<details><summary>Task 2 - Hypertext Transfer Protocol (HTTP)</summary>


1.	:point_right: First, we connect to port 80 using telnet 10.10.221.93 80.
2.	:point_right: Next, we need to type GET /index.html HTTP/1.1 to retrieve the page index.html or GET / HTTP/1.1 to retrieve the default page.
3.	:point_right: Finally, you need to provide some value for the host like host: telnet and hit the Enter/Return key twice.


### Launch the attached VM. From the AttackBox terminal, connect using Telnet to 10.10.221.93 80 and retrieve the file flag.thm. What does it contain?

```bash
telnet 10.10.221.93 80
Trying 10.10.221.93...
Connected to 10.10.221.93.
Escape character is '^]'.

'GET /flag.thm HTTP/1.1'
'host: telnet'

HTTP/1.1 200 OK
Server: nginx/1.18.0 (Ubuntu)
Date: Wed, 25 May 2022 03:43:24 GMT
Content-Type: application/octet-stream
Content-Length: 39
Last-Modified: Wed, 15 Sep 2021 09:19:23 GMT
Connection: keep-alive
ETag: "6141ba9b-27"
Accept-Ranges: bytes

THM{e3eb0a1df437f3f97a64aca5952c8ea0}

```
</details>

<details><summary> Task 3 - File Transfer Protocol (FTP) </summary>

### Using an FTP client, connect to the VM and try to recover the flag file. What is the flag?

    Username: frank
    Password: D2xc9CgD


```bash
ftp 10.10.221.93
Connected to 10.10.221.93.
220 (vsFTPd 3.0.3)
Name (10.10.221.93:root): frank
331 Please specify the password.
Password: 
230 Login successful.
Remote system type is UNIX.
Using binary mode to transfer files.
ftp> ls
229 Entering Extended Passive Mode (|||16062|)
150 Here comes the directory listing.
drwx------   10 1001     1001         4096 Sep 15  2021 Maildir
-rw-rw-r--    1 1001     1001         4006 Sep 15  2021 README.txt
-rw-rw-r--    1 1001     1001           39 Sep 15  2021 ftp_flag.thm
226 Directory send OK.
ftp> get ftp_flag.thm
local: ftp_flag.thm remote: ftp_flag.thm
229 Entering Extended Passive Mode (|||13433|)
150 Opening BINARY mode data connection for ftp_flag.thm (39 bytes).
100% |*************************************************************************************************************************************************|    39       11.93 KiB/s    00:00 ETA
226 Transfer complete.
39 bytes received in 00:00 (0.11 KiB/s)
ftp> q
?Ambiguous command.
ftp> exit
221 Goodbye.
```
```
THM{364db6ad0e3ddfe7bf0b1870fb06fbdf}
```
</details>

<details><summary> Task 4 - Simple Mail Transfer Protocol (SMTP)  </summary>

```
SMTP server listens on port 25 by default. To see basic communication with an SMTP server, we used Telnet to connect to it. Once connected, we issue helo hostname and then start typing our email.
Pentester Terminal

           
pentester@TryHackMe$ telnet 10.10.221.93 25
Trying 10.10.221.93...
Connected to MACHINE_IP.
Escape character is '^]'.
220 bento.localdomain ESMTP Postfix (Ubuntu)
helo telnet
250 bento.localdomain
mail from: 
250 2.1.0 Ok
rcpt to: 
250 2.1.5 Ok
data
354 End data with .
subject: Sending email with Telnet
Hello Frank,
I am just writing to say hi!             
.
250 2.0.0 Ok: queued as C3E7F45F06
quit
221 2.0.0 Bye
Connection closed by foreign host.

        

After helo, we issue mail from:, rcpt to: to indicate the sender and the recipient. When we send our email message, we issue the command data and type our message. We issue <CR><LF>.<CR><LF> (or Enter . Enter to put it in simpler terms). The SMTP server now queues the message.

Generally speaking, we don’t need to memorize SMTP commands. The console output above aims to help better explain what a typical mail client does when it uses SMTP.
```

### Using the AttackBox terminal, connect to the SMTP port of the target VM. What is the flag that you can get? 

```bash
telnet 10.10.221.93 25
Trying 10.10.221.93...
Connected to 10.10.221.93.
Escape character is '^]'.
220 bento.localdomain ESMTP Postfix THM{5b31ddfc0c11d81eba776e983c35e9b5}
helo telnet
250 bento.localdomain
```

</details>

<details><summary> Task 5 - Post Office Protocol 3 (POP3)  </summary>

```
The example below shows what a POP3 session would look like if conducted via a Telnet client. First, the user connects to the POP3 server at the POP3 default port 110. Authentication is required to access the email messages; the user authenticates by providing his username USER frank and password PASS D2xc9CgD. Using the command STAT, we get the reply +OK 1 179; based on RFC 1939, a positive response to STAT has the format +OK nn mm, where nn is the number of email messages in the inbox, and mm is the size of the inbox in octets (byte). The command LIST provided a list of new messages on the server, and RETR 1 retrieved the first message in the list. We don’t need to concern ourselves with memorizing these commands; however, it is helpful to strengthen our understanding of such protocol.

           
           
pentester@TryHackMe$ telnet 10.10.221.93 110
Trying 10.10.221.93...
Connected to MACHINE_IP.
Escape character is '^]'.
+OK MACHINE_IP Mail Server POP3 Wed, 15 Sep 2021 11:05:34 +0300 
USER frank
+OK frank
PASS D2xc9CgD
+OK 1 messages (179) octets
STAT
+OK 1 179
LIST
+OK 1 messages (179) octets
1 179
.
RETR 1
+OK
From: Mail Server 
To: Frank 
subject: Sending email with Telnet
Hello Frank,
I am just writing to say hi!
.
QUIT
+OK MACHINE_IP closing connection
Connection closed by foreign host.

        

The example above shows that the commands are sent in cleartext. Using Telnet was enough to authenticate and retrieve an email message. As the username and password are sent in cleartext, any third party watching the network traffic can steal the login credentials.

In general, your mail client (MUA) will connect to the POP3 server (MDA), authenticate, and download the messages. Although the communication using the POP3 protocol will be hidden behind a sleek interface, similar commands will be issued, as shown in the Telnet session above.

Based on the default settings, the mail client deletes the mail message after it downloads it. The default behaviour can be changed from the mail client settings if you wish to download the emails again from another mail client. Accessing the same mail account via multiple clients using POP3 is usually not very convenient as one would lose track of read and unread messages. To keep all mailboxes synchronized, we need to consider other protocols, such as IMAP.
```

###	Connect to the VM (10.10.221.93) at the POP3 port. Authenticate using the username frank and password D2xc9CgD. What is the response you get to STAT?
```bash
telnet 10.10.221.93 110
Trying 10.10.221.93...
Connected to 10.10.221.93.
Escape character is '^]'.
+OK Hello there.
user frank
+OK Password required.
PASS D2xc9CgD
+OK logged in.
STAT
+OK 0 0
LIST
+OK POP3 clients that break here, they violate STD53.
```

```
+OK 0 0
```

###	How many email messages are available to download via IMAP on 10.10.221.93?

```
0
```

</details>

<details><summary> Summary </summary>

|	Protocol | 	TCP Port |	Application(s) |	Data Security |
|	---	|	---	|	---	|	---	|
|	FTP	|	22 	|	File Transfer	|	Cleartext	|
|	HTTP	|	80	|	Worldwide Web|	Cleartext	|
|	IMAP |	143	|	Email (MDA)	|	Cleartext	|
|POP3	|	110	|	Email (MDA)	|	Cleartext	|
|	SMTP	|	25	|	Email (MTA)	|	Cleartext	|
|	Telnet	|	23	|	Remote Access	|	Cleartext	|

</details>
